console.log("#1 - завдання")
// 1.Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
let i = 0;
while (i < 10) {
    i += 1;
    console.log(i);
}
console.log("#2 - завдання")
// 2.Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.
for (let i2 = 1; i2 < 21; i2 += 1) {
    if (i2 % 2 === 0) {
        console.log(i2)
        continue;
    }
}
console.log("#3 - завдання")
// 3.Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
for (let i3 = 1; i3 < 11; i3++) {
    let result = i3 * 7;
    console.log(`${i3} * 7 = ${result}`);
}
console.log("#4 - завдання")
// 4.Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
let n = 15;
let i5 = 0;
while (i5 < 100) {
   i5 += 1;
   console.log(i5);
   if (i5 >= n) {
    break;
   }
}
console.log("#5 - завдання")
// 5.За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let i4 = 0;
while (i4 < 20) {
    i4 += 1;
    if (i4 % 3 === 0) {
        console.log(i4);
        continue;
    }
}
